{"data":{"site":{"siteMetadata":{"title":"Luciano Mammino \"Loige\" - Web developer, entrepreneur, fighter, butterfly maker!"}}},"pageContext":{"posts":[{"timeToRead":6,"excerpt":"This article presents a quick tip that will help you deal with the content of files in S3 through the AWS command line in a much faster and simpler way. Did you ever want to simply print the content of a file in S3 from your command line and maybe pipe the output to another command? Or maybe, did you ever needed to pipe the standard output of a sequence of commands directly into a file in S3? I had this need multiple times and, before my amazing colleague Paul made me discover the tip I am about to describe…","fields":{"slug":"aws-command-line-s3-content-from-stdin-or-to-stdout"},"frontmatter":{"date":"05 May, 2018","title":"AWS Command line: S3 content from stdin or to stdout","tags":["aws","bash","shell"],"header_img":{"publicURL":"/static/aws-command-line-s3-content-from-stdin-or-to-stdout-loige-co-luciano-mammino-5a8d5e659e9cbbaf35101f4871e4f445.jpg"}}},{"timeToRead":14,"excerpt":"2017 is over and it’s time to sit down and see what happened during this year. As I already did  last year , I would love to write a (potentially boring) recap of all the good and bad things (mostly from a career perspective) that happened in my life during this year. Last year I promised myself I would keep doing this as a way to keep track and benchmark my productivity over the coming years, so here I am to see how I performed! The year of conference talks! Let’s start with a big win! This was the year of…","fields":{"slug":"2017-a-year-in-review"},"frontmatter":{"date":"03 January, 2018","title":"2017 - A year in review","tags":["life"],"header_img":{"publicURL":"/static/loige-co-2017-a-year-in-review-luciano-mammino-blog-ab886b384d44f11001e18666b792ffd1.jpg"}}},{"timeToRead":12,"excerpt":"Lately, I tried to understand why modern cloud computing brought us to the idea (and growing adoption) of “Serverless”. In this article, I will illustrate the result of a small research I did about the history of Cloud computing from the age of  bare metal  to  serverless . “You have to know the past to understand the present.” ― Carl Sagan At the end of this article, I will also illustrate a definition of Serverless and what are its main characteristics. The invention of the web This story starts with  Sir…","fields":{"slug":"from-bare-metal-to-serverless"},"frontmatter":{"date":"16 December, 2017","title":"From bare metal to Serverless","tags":["serverless","aws"],"header_img":{"publicURL":"/static/from-bare-metal-to-serverless-luciano-mammino-loige-co-917e1c27c76ede42e7c2693844bd6898.jpg"}}},{"timeToRead":18,"excerpt":"Recently at  Planet 9 Energy , I had to setup a VPN access to secure some of our internal services. One of the requirements was to make the provisioning easy to reproduce over multiple environments, so we ended up playing a bit with Terraform, while obviously adopting OpenVPN for the VPN server. Another important requirement was to expose the OpenVPN web interface (also called Access Server) using an SSL, which I was expecting to be one of the most challenging things to automate, instead, it turned out to…","fields":{"slug":"using-lets-encrypt-and-certbot-to-automate-the-creation-of-certificates-for-openvpn"},"frontmatter":{"date":"19 June, 2017","title":"Using Let’s Encrypt and Certbot to automate the creation of certificates for OpenVPN","tags":["ssl","web","terraform","security","aws"],"header_img":{"publicURL":"/static/using-lets-encrypt-and-certbot-to-automate-the-creation-of-certificates-for-openvpn-loige-icover-image-45dfcbcf12ab7cac8a20f867207af385.jpg"}}},{"timeToRead":2,"excerpt":"This June, I had an amazing experience talking again about Serverless and how we use it at  Planet 9 Energy  at the recent  Shift Conference  in Split, Croatia. In my talk titled ” Serverless: The pros and cons of building a company\nwithout infrastructure ”, I tried to address what Serverless is and why is becoming such a big thing, also exploring what I believe are the pros and cons of this new paradigm. The experience was great and I was super happy to have a chance to share the stage with extraordinary…","fields":{"slug":"my-serverless-talk-at-shift-conference-in-split"},"frontmatter":{"date":"15 June, 2017","title":"My Serverless talk at Shift conference in Split","tags":["conferences","slides","speaking","serverless","javascript","node-js"],"header_img":{"publicURL":"/static/my-serverless-talk-at-shift-conference-in-split-cover-picture-ea5bb4fdb59eb7d14eb0a6b5a7e64465.jpg"}}},{"timeToRead":3,"excerpt":"Last month (March 25th) I had the pleasure of delivering again my Universal JavaScript talk in a Codemotion Event,  this time in Rome .\nAs expected it was a super interesting event and it gave me the chance to meet fantastic people, attend inspiring talks and refine my presentation. Judo Heroes Version 2 For this occasion, I updated my common Universal JavaScript  Judo Heroes  to ” Version 2 “. I believe this new version looks a bit more polished and easy to understand, plus it features a number of other…","fields":{"slug":"my-universal-javascript-web-applications-talk-at-codemotion-rome-2017"},"frontmatter":{"date":"11 April, 2017","title":"My Universal JavaScript Web Applications talk at Codemotion Rome 2017","tags":["slides","talk","react","javascript","node-js"],"header_img":{"publicURL":"/static/my-universal-javascript-web-applications-talk-at-codemotion-rome-2017-81dfb22d9ac6836b1eac4decfedcc011.jpg"}}},{"timeToRead":5,"excerpt":"Short URLs have been an invaluable tool for social media marketing for so many years and we are now used to seeing them everywhere. Most of the credit probably goes to  URL shorteners  services like  Bit.ly ,  Goo.gl ,  YOURLS  and  Rebrandly  that popularised the concept and made easy for everyone to start creating short URLs. When working with URLs in some automation scenarios like analytics, information crawling, data retrieval, etc. it can be important to  resolve  (or ” unshorten ” or ” expand ”) short…","fields":{"slug":"unshorten-expand-short-urls-with-node-js"},"frontmatter":{"date":"31 March, 2017","title":"Unshorten (expand) short URLs with Node.js","tags":["node-js","library","javascript"],"header_img":{"publicURL":"/static/unshorten-expand-short-urls-with-node-js-loige-compressed-a7f642a4a7a3fd1e66aaf282f08549bf.jpg"}}},{"timeToRead":2,"excerpt":"Last January I had the pleasure to share the stage with the great  Padraig O’Brien  to talk about how we use Node.js, AWS Lambda and the Serverless framework at  Planet9 Energy . The talk was hosted by the monthly  Node.js Dublin Meetup  at Intercom Dublin office, as usual, a very cool location for this kind of tech talks. Apart from having a great chance to show off my über cool Super Mario T-shirt for about 45 minutes, Podge and I had some good time discussing the following topics: What does ” Serverless…","fields":{"slug":"my-serverless-aws-lambda-talk-at-nodejs-dublin-january-2017"},"frontmatter":{"date":"14 February, 2017","title":"My Serverless & AWS Lambda talk at Node.js Dublin January 2017","tags":["slides","talk","node-js","javascript","aws-lambda","serverless"],"header_img":{"publicURL":"/static/my-serverless-aws-lambda-talk-at-nodejs-dublin-january-2017-6648e9e21e72bcdee5efa0cb642e699c.png"}}},{"timeToRead":10,"excerpt":"2016 is almost over and I just realised that it has been one of my most productive and exciting years ever. With that in mind I would love to write a recap of all the good and bad things (mostly from a career perspective) that happened in my life  during this year. I want to keep track and benchmark my productivity over the coming years. This might be boring for you to read but I hope it’s going to serve myself as a good motivation to keep doing better over the years, both in terms of career and quality of…","fields":{"slug":"2016-a-year-in-review"},"frontmatter":{"date":"24 December, 2016","title":"2016 - A year in review","tags":["life"],"header_img":{"publicURL":"/static/loige-luciano-mammino-2016-a-year-in-review-blog-post-daa9b86bee70577651d76acbc4829098.jpg"}}},{"timeToRead":24,"excerpt":"Yesterday (25/11/2016) I had the pleasure of delivering a talk about Universal JavaScript at  Codemotion Milan 2016 . It was a great fun and I was very happy to meet such a big pool of technology enthusiasts and professionals all in one places. I’m already looking forward for the next edition! Video Update  (12-12-2016): a video recording of the talk has been published by the folks at Codemotion: Slides deck If you are interested in my talk you can find the slides on  Slides.com : Commentary Here follows…","fields":{"slug":"my-universal-javascript-web-applications-talk-at-codemotion-milan-2016-2"},"frontmatter":{"date":"26 November, 2016","title":"My Universal JavaScript Web Applications talk at Codemotion Milan 2016","tags":["slides","talk","node-js","javascript","react"],"header_img":{"publicURL":"/static/my-universal-javascript-web-applications-talk-at-codemotion-milan-2016-2-5d1ec54343e786035ac9ede72961e2cf.jpg"}}}],"previous":null,"next":{"page":2,"href":"/page/2/"},"currentPage":1,"totalPages":5}}