{"data":{"site":{"siteMetadata":{"title":"Luciano Mammino \"Loige\" - Web developer, entrepreneur, fighter, butterfly maker!"}}},"pageContext":{"posts":[{"timeToRead":14,"excerpt":"2017 is over and it’s time to sit down and see what happened during this year. As I already did  last year , I would love to write a (potentially boring) recap of all the good and bad things (mostly from a career perspective) that happened in my life during this year. Last year I promised myself I would keep doing this as a way to keep track and benchmark my productivity over the coming years, so here I am to see how I performed! The year of conference talks! Let’s start with a big win! This was the year of…","fields":{"slug":"2017-a-year-in-review"},"frontmatter":{"date":"03 January, 2018","title":"2017 - A year in review","tags":["life"],"header_img":{"publicURL":"/static/loige-co-2017-a-year-in-review-luciano-mammino-blog-ab886b384d44f11001e18666b792ffd1.jpg"}}},{"timeToRead":10,"excerpt":"2016 is almost over and I just realised that it has been one of my most productive and exciting years ever. With that in mind I would love to write a recap of all the good and bad things (mostly from a career perspective) that happened in my life  during this year. I want to keep track and benchmark my productivity over the coming years. This might be boring for you to read but I hope it’s going to serve myself as a good motivation to keep doing better over the years, both in terms of career and quality of…","fields":{"slug":"2016-a-year-in-review"},"frontmatter":{"date":"24 December, 2016","title":"2016 - A year in review","tags":["life"],"header_img":{"publicURL":"/static/loige-luciano-mammino-2016-a-year-in-review-blog-post-daa9b86bee70577651d76acbc4829098.jpg"}}},{"timeToRead":1,"excerpt":"Yep!  Finally  here’s the  first  post on the path of this blog.  Finally/first , indeed a curious binomial with a weird sound, but I think it’s a good title to start this adventure.\nI’ll try to keep it simple and avoid to bloat things out… just start dancing by answering to a simple question, maybe the proper one now:  Why start a blog? \nWell, I’m a web developer, fascinated by the web since I was a child and started writing my first lines of code in  qbasic , and as any other serious web developer it…","fields":{"slug":"finally-first"},"frontmatter":{"date":"16 January, 2014","title":"Finally/First","tags":["life"],"header_img":{"publicURL":"/static/finally-first-86737c5aac53f6339e09eef905a798ae.png"}}}],"tag":"life"}}