{"data":{"site":{"siteMetadata":{"title":"Luciano Mammino \"Loige\" - Web developer, entrepreneur, fighter, butterfly maker!"}}},"pageContext":{"posts":[{"timeToRead":3,"excerpt":"A couple of days ago I had the need to store the MongoDB connection string for a Node.js application I am currently building.\nOf course it was not a big deal and at first I stored it in a file.\nAnyway at some point I realised that I would needed to override parts of this string to change some settings in  production  (e.g. adding replicas and authentication settings).\nFor this sake it would have been nice to have a way to store this configuration as a “well organised” object and then override just the…","fields":{"slug":"introducing-mongo-uri-builder-a-nodejs-module-to-easily-create-mongodb-connection-strings-using-objects"},"frontmatter":{"date":"29 September, 2015","title":"Introducing mongo-uri-builder, a Node.js module to easily create mongodb connection strings using objects","tags":["node-js","library","mongodb","github"],"header_img":{"publicURL":"/static/mongo-uri-builder-article-sample-image-2631a85bd72a9afcb89633ddc1e4af8d.jpg"}}},{"timeToRead":1,"excerpt":"I recently wrote a  Slack bot  in  Node.js  in collaboration with one of my favourite web development websites: the amazing  Scotch.io . It’s a simple and funny experiment I have done in my free time to learn something new. It’s nothing special but it will add a bit of fun inside your Slack organisation…  Who doesn’t want to have a bot that tells random jokes about Chuck Norris in his own Company chat room?  :) The bot is available on Github ( lmammino/norrisbot ) and on NPM ( norrisbot ) and it can be…","fields":{"slug":"having-fun-with-nodejs-slack-and-chuck-norris"},"frontmatter":{"date":"14 September, 2015","title":"Having fun with Node.js, Slack and Chuck Norris","tags":["node-js","slack","collaboration"],"header_img":{"publicURL":"/static/having-fun-with-nodejs-slack-and-chuck-norris-8c6cc21b8df7bd6c91459707a6b749fd.jpg"}}},{"timeToRead":1,"excerpt":"Do you ever wondered how to manage the  versioning  and  deployment  process of a website? It seems to be a very interesting yet complex topic for which there are already thousands of different solutions.\nIn a recent collaboration with  Usersnap  I had the pleasure to write a very detailed article for their blog that proposes a solution based on  Flightplan.js ,  Git  and  Nginx . My solution is very simple, it requires very few dependencies on your system (Git and Node.js) and it has been thought to give…","fields":{"slug":"versioning-and-deploying-a-static-website-with-git-flightplan-and-nginx"},"frontmatter":{"date":"08 September, 2015","title":"Versioning and deploying a static website with Git, Flightplan and Nginx","tags":["javascript","server","node-js","nginx","git","flightplan","collaboration"],"header_img":{"publicURL":"/static/Versioning-and-deploying-a-static-website-with-git-flightplan-and-nginx-5640d7294c058bcc1a2919c0934a8e19.jpg"}}},{"timeToRead":17,"excerpt":"In this post I will try to highlight some of the most common principles that you have to take under consideration when you want to achieve a great level of performance while building a web application (specifically on the backend part). I believe the concepts discussed here can be applied to any language and framework even if, due to my specific experience, I will mention some examples, design patterns, conventions and tools that are mostly used in the PHP world. You can read this article in other languages…","fields":{"slug":"6-rules-of-thumb-to-build-blazing-fast-web-applications"},"frontmatter":{"date":"25 July, 2015","title":"6 Rules of thumb to build blazing fast web server applications","tags":["php","symfony","laravel","performance","scalaibility"],"header_img":{"publicURL":"/static/6-rules-of-thumb-to-build-blazing-fast-web-applications-flash-gordon-1-d9b9a66ae929c0ee6b10053525036ec5.jpg"}}},{"timeToRead":3,"excerpt":"Hello dear developers,\ntoday I finally got my invitation to access the private beta of  Keybase.io ! 😎 🎉\nFor those who are not aware of this new service, Keybase.io is a website and a command line application that makes easier to adopt asymmetric cryptography to encrypt and authenticate messages. But it’s not just this, it’s also a  “directory of people” , as they like to say. It’s like a social network, where everyone can easily share its public key and attach it to its social profiles (like Twitter…","fields":{"slug":"8-invitations-to-try-keybase-io"},"frontmatter":{"date":"26 May, 2015","title":"8 invitations to try Keybase.io","tags":["security","cryptography"],"header_img":{"publicURL":"/static/8-invitations-to-try-keybase-io-f86f086dfbd40709f8691bf576ea501a.jpg"}}},{"timeToRead":4,"excerpt":"I recently developed a small command line app that allows you to download an entire gallery from Flickr, it’s called   and you can find it on  NPM  and  GitHub . Why? To be honest I had myself the need to download a large set of photos (more than 400 photos) from Flickr and I didn’t wanted to do it manually. I also wasn’t able, after a quick search, to find something simple to solve this task. Given that I am currently getting into deep of Node.js this was the perfect chance to develop something practical…","fields":{"slug":"introducing-flickr-set-get-a-command-line-app-to-download-photos"},"frontmatter":{"date":"11 May, 2015","title":"Introducing flickr-set-get a command line app to download photos","tags":["javascript","http","node-js","api","flickr"],"header_img":{"publicURL":"/static/flickr-set-get-download-photos-from-command-line-flickr-56435f04f3c8b820b76276af7e4eee2d.jpg"}}},{"timeToRead":10,"excerpt":"Lumen  is a new  Php  micro-framework developed by  Taylor Otwell , the same author of the famous  Laravel  framework. I wanted to give it a try and I am here to share my experimentations. I am not an expert of Lumen (yet), but I think one of the best characteristics of this framework is that it makes really really easy to bootstrap a new project.\nSo to prove this, we will now build a fully functional app backed by a MySql database in less than 30 minutes. Are you ready to start? A motivational quote…","fields":{"slug":"developing-a-web-application-with-lumen-and-mysql"},"frontmatter":{"date":"18 April, 2015","title":"Developing a web application with Lumen and MySql","tags":["php","mysql","lumen","laravel"],"header_img":{"publicURL":"/static/developing-a-web-application-with-lumen-de4e7c62eaaa7504bae0f67a967ee639.jpg"}}},{"timeToRead":5,"excerpt":"One of the things I like most of the Symfony framework is its  Http Kernel component . Not only it does offer a very straightforward abstraction to handle requests and responses in an object-oriented way but it also allows you to interact with the whole response generation process through  events . This approach is very convenient and flexible and in fact the Http Kernel component is the foundation of the Symfony framework but also of several other famous frameworks (Silex, Laravel) and CMSes (Drupal…","fields":{"slug":"symfony-edit-the-response-globally-using-the-kernel-response-event"},"frontmatter":{"date":"21 February, 2015","title":"Symfony, edit the Response globally using the Kernel Response event","tags":["php","symfony","http"],"header_img":{"publicURL":"/static/symfony-edit-the-response-globally-using-the-kernel-response-event-6ac1c6c77e2d54cb09869c500106341d.jpg"}}},{"timeToRead":5,"excerpt":"What a hell of 3 months! During the last 3 months I haven’t got a single minute to take care of this blog. I started a new adventure and moved to Ireland to attend the Bank of Ireland Accelerator Programme in Cork with my startup  Sbaam . There I spent 3 incredible months with a huge amount of lessons learned about  startups  and  entrepreneurship . I want to share with you 5 of the best quotes I heard from the mentors and explain what I learned from them. Consider this is my first “non technical” post with…","fields":{"slug":"5-lessons-learned-at-the-bank-of-ireland-accelerator"},"frontmatter":{"date":"22 December, 2014","title":"5 lessons learned at the Bank of Ireland Accelerator","tags":["startup","entrepreneurship"],"header_img":{"publicURL":"/static/boi-1-0b48e4fdee9f504b52953660f83be2dd.png"}}},{"timeToRead":9,"excerpt":"In this post we will see how to write a (very) simple  Go server app  and how to put it into a  Docker container  and run it. Disclaimer : I’m an absolute beginner with both  Go  and  Docker  and this is just an experiment I did to start to explore this two interesting technologies. If you’ll find something weird or wrong you are  very  encouraged to scream at me in the comments ( Comments ), I will be extremely thankful ;) Introduction We are going to write a simple echo server in Go and then we will pack…","fields":{"slug":"simple-echo-server-written-in-go-dockerized"},"frontmatter":{"date":"29 June, 2014","title":"Simple echo server written in Go, dockerized!","tags":["server","go","docker"],"header_img":{"publicURL":"/static/simple-echo-server-written-in-go-dockerized-d501b84eb19ffd911014f65477f60813.jpg"}}}],"previous":{"page":2,"href":"/page/2/"},"next":{"page":4,"href":"/page/4/"},"currentPage":3,"totalPages":5}}