{"data":{"site":{"siteMetadata":{"title":"Luciano Mammino \"Loige\" - Web developer, entrepreneur, fighter, butterfly maker!"}}},"pageContext":{"posts":[{"timeToRead":6,"excerpt":"This article presents a quick tip that will help you deal with the content of files in S3 through the AWS command line in a much faster and simpler way. Did you ever want to simply print the content of a file in S3 from your command line and maybe pipe the output to another command? Or maybe, did you ever needed to pipe the standard output of a sequence of commands directly into a file in S3? I had this need multiple times and, before my amazing colleague Paul made me discover the tip I am about to describe…","fields":{"slug":"aws-command-line-s3-content-from-stdin-or-to-stdout"},"frontmatter":{"date":"05 May, 2018","title":"AWS Command line: S3 content from stdin or to stdout","tags":["aws","bash","shell"],"header_img":{"publicURL":"/static/aws-command-line-s3-content-from-stdin-or-to-stdout-loige-co-luciano-mammino-5a8d5e659e9cbbaf35101f4871e4f445.jpg"}}},{"timeToRead":12,"excerpt":"Lately, I tried to understand why modern cloud computing brought us to the idea (and growing adoption) of “Serverless”. In this article, I will illustrate the result of a small research I did about the history of Cloud computing from the age of  bare metal  to  serverless . “You have to know the past to understand the present.” ― Carl Sagan At the end of this article, I will also illustrate a definition of Serverless and what are its main characteristics. The invention of the web This story starts with  Sir…","fields":{"slug":"from-bare-metal-to-serverless"},"frontmatter":{"date":"16 December, 2017","title":"From bare metal to Serverless","tags":["serverless","aws"],"header_img":{"publicURL":"/static/from-bare-metal-to-serverless-luciano-mammino-loige-co-917e1c27c76ede42e7c2693844bd6898.jpg"}}},{"timeToRead":18,"excerpt":"Recently at  Planet 9 Energy , I had to setup a VPN access to secure some of our internal services. One of the requirements was to make the provisioning easy to reproduce over multiple environments, so we ended up playing a bit with Terraform, while obviously adopting OpenVPN for the VPN server. Another important requirement was to expose the OpenVPN web interface (also called Access Server) using an SSL, which I was expecting to be one of the most challenging things to automate, instead, it turned out to…","fields":{"slug":"using-lets-encrypt-and-certbot-to-automate-the-creation-of-certificates-for-openvpn"},"frontmatter":{"date":"19 June, 2017","title":"Using Let’s Encrypt and Certbot to automate the creation of certificates for OpenVPN","tags":["ssl","web","terraform","security","aws"],"header_img":{"publicURL":"/static/using-lets-encrypt-and-certbot-to-automate-the-creation-of-certificates-for-openvpn-loige-icover-image-45dfcbcf12ab7cac8a20f867207af385.jpg"}}}],"tag":"aws"}}