{"data":{"site":{"siteMetadata":{"title":"Luciano Mammino \"Loige\" - Web developer, entrepreneur, fighter, butterfly maker!"}}},"pageContext":{"posts":[{"timeToRead":3,"excerpt":"Last month (March 25th) I had the pleasure of delivering again my Universal JavaScript talk in a Codemotion Event,  this time in Rome .\nAs expected it was a super interesting event and it gave me the chance to meet fantastic people, attend inspiring talks and refine my presentation. Judo Heroes Version 2 For this occasion, I updated my common Universal JavaScript  Judo Heroes  to ” Version 2 “. I believe this new version looks a bit more polished and easy to understand, plus it features a number of other…","fields":{"slug":"my-universal-javascript-web-applications-talk-at-codemotion-rome-2017"},"frontmatter":{"date":"11 April, 2017","title":"My Universal JavaScript Web Applications talk at Codemotion Rome 2017","tags":["slides","talk","react","javascript","node-js"],"header_img":{"publicURL":"/static/my-universal-javascript-web-applications-talk-at-codemotion-rome-2017-34e2a6d18bdaec1aa33c0f25930a90a3.jpg"}}},{"timeToRead":24,"excerpt":"Yesterday (25/11/2016) I had the pleasure of delivering a talk about Universal JavaScript at  Codemotion Milan 2016 . It was a great fun and I was very happy to meet such a big pool of technology enthusiasts and professionals all in one places. I’m already looking forward for the next edition! Video Update  (12-12-2016): a video recording of the talk has been published by the folks at Codemotion: Slides deck If you are interested in my talk you can find the slides on  Slides.com : Commentary Here follows…","fields":{"slug":"my-universal-javascript-web-applications-talk-at-codemotion-milan-2016-2"},"frontmatter":{"date":"26 November, 2016","title":"My Universal JavaScript Web Applications talk at Codemotion Milan 2016","tags":["slides","talk","node-js","javascript","react"],"header_img":{"publicURL":"/static/my-universal-javascript-web-applications-talk-at-codemotion-milan-2016-2-5d1ec54343e786035ac9ede72961e2cf.jpg"}}},{"timeToRead":1,"excerpt":"I recently wrote a new article in collaboration with one of my favourite web development websites: the amazing  Scotch.io . The article talk about using  React  both on client and on the server (with  Node.js ) in an attempt to build a simple “Universal JavaScript” (a.k.a “Isomorphic”) application. The application is called “Judo Heroes” ( did you even noticed recently that I’m kind of fond of Judo? ) and it showcases some of the best Judo athletes for their number of medals won during the Olympic Games and…","fields":{"slug":"react-on-the-server-for-beginners-build-a-universal-react-and-node-app"},"frontmatter":{"date":"29 August, 2016","title":"React on the Server for Beginners: Build a Universal React and Node App","tags":["node-js","react","collaboration"],"header_img":{"publicURL":"/static/ryoko-tani-universal-javascript-nodejs-react-luciano-mammino-cover-800b14fb31bd9abfa9102aa9a341562d.jpg"}}}],"tag":"react"}}